AccumulationRegisters/ОтработанноеВремяПоСотрудникамКорректировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОтработанноеВремяПоСотрудникамКорректировка</Name>
			<Comment>Значения для корректного учета отработанных дней при наличии более одного вида рабочего времени за день</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НачисленияУдержанияПоСотрудникамАвансом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияУдержанияПоСотрудникамАвансом</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОплаченоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеУдержание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОтработанноеВремяПоСотрудникамАвансом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОтработанноеВремяПоСотрудникамАвансом</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПоказателейНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПоказателейНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистраторИзмерение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СторнированиеНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.ПростойСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплатыСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.Отпуск</v8:Type>
						<v8:Type>cfg:DocumentRef.БольничныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.РазовоеНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.Увольнение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускБезСохраненияОплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрогулНеявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоходВНатуральнойФорме</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеСписком</v8:Type>
						<v8:Type>cfg:DocumentRef.МатериальнаяПомощь</v8:Type>
						<v8:Type>cfg:DocumentRef.Отгул</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтпускПоУходуЗаРебенком</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЗарплатаКадрыОбщиеНаборыДанныхРасширенный/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстОбщегоЗапроса(ИсточникДанных) Экспорт
	
	ТекстЗапроса = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ПолучитьТекстОбщегоЗапроса(ИсточникДанных);
	
	Если ВРег(ИсточникДанных) = ВРег("НачисленияУдержания") Тогда
		// В расширенной реализации необходимо учитывать корректировки отработанного времени.
		
		ФрагментЗапросаДляЗамены =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДокументОснование КАК ДокументОснование,
			|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	МИНИМУМ(ОтработанноеВремя.СтатьяРасходов) КАК СтатьяРасходов
			|ПОМЕСТИТЬ ВТОтработанноеВремяСКорректировками
			|ИЗ
			|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяСоСтатьейФинансирования КАК ОтработанноеВремяСоСтатьейФинансирования
			|		ПО ОтработанноеВремя.МесяцНачисления = ОтработанноеВремяСоСтатьейФинансирования.МесяцНачисления
			|			И ОтработанноеВремя.ПериодДействия = ОтработанноеВремяСоСтатьейФинансирования.ПериодДействия
			|			И ОтработанноеВремя.Регистратор = ОтработанноеВремяСоСтатьейФинансирования.Регистратор
			|			И ОтработанноеВремя.Сотрудник = ОтработанноеВремяСоСтатьейФинансирования.Сотрудник
			|			И ОтработанноеВремя.Подразделение = ОтработанноеВремяСоСтатьейФинансирования.Подразделение
			|			И ОтработанноеВремя.ВидРасчета = ОтработанноеВремяСоСтатьейФинансирования.ВидРасчета
			|			И ОтработанноеВремя.ДатаНачала = ОтработанноеВремяСоСтатьейФинансирования.ДатаНачала
			|			И ОтработанноеВремя.СтатьяФинансирования = ОтработанноеВремяСоСтатьейФинансирования.СтатьяФинансирования
			|			И ОтработанноеВремя.ВремяВЧасах = ОтработанноеВремяСоСтатьейФинансирования.ВремяВЧасах
			|			И ОтработанноеВремя.ДокументОснование = ОтработанноеВремяСоСтатьейФинансирования.ДокументОснование
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ДокументОснование,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.Начисление,
			|	ОтработанноеВремя.ОтработаноДней,
			|	NULL,
			|	ОтработанноеВремя.ОплаченоДней,
			|	NULL,
			|	ОтработанноеВремя.ДатаНачала,
			|	NULL,
			|	ЛОЖЬ,
			|	ОтработанноеВремя.ДокументОснование,
			|	NULL,
			|	NULL
			|ИЗ
			|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
			|ГДЕ
			|	ОтработанноеВремя.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.ФизическоеЛицо,
			|	ОтработанноеВремя.Организация}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДокументОснование,
			|	СУММА(ОтработанноеВремя.ОтработаноДней) КАК ОтработаноДней,
			|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	СУММА(ОтработанноеВремя.ОплаченоДней) КАК ОплаченоДней,
			|	СУММА(ОтработанноеВремя.ОплаченоЧасов) КАК ОплаченоЧасов,
			|	МАКСИМУМ(ОтработанноеВремя.СтатьяФинансирования) КАК СтатьяФинансирования,
			|	МАКСИМУМ(ОтработанноеВремя.СтатьяРасходов) КАК СтатьяРасходов,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремя
			|ИЗ
			|	ВТОтработанноеВремяСКорректировками КАК ОтработанноеВремя
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ДокументОснование,
			|	ОтработанноеВремя.ИдентификаторСтроки";
		
		Если Не ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросСозданияВременнойТаблицы(ТекстЗапроса, "ВТОтработанноеВремя", ФрагментЗапросаДляЗамены) Тогда
			ВызватьИсключение НСтр("ru='Неправильный текст запроса к отработанному времени'");
		КонецЕсли;
		
		ДополнитьТекстЗапросаНачисленияУдержанияКадровымиДанными(ТекстЗапроса);
		ДополнитьТекстЗапросаНачисленияУдержанияЗначениямиПоказателей(ТекстЗапроса);
		
	ИначеЕсли ВРег(ИсточникДанных) = ВРег("НачисленияУдержанияАвансом") Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
			|ПОМЕСТИТЬ Представления_Периоды
			|ГДЕ
			|	""НачалоИнтервала"" = &НачалоПериода
			|	И ""ОкончаниеИнтервала"" = &КонецПериода
			|	И ""Периодичность"" = ""МЕСЯЦ""
			|	И ""ИспользоватьКонецПериода"" = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период
			|ПОМЕСТИТЬ ВТВсеСотрудникиСПериодом
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Месяц, , {(Сотрудник), (ФизическоеЛицо), (Организация)}) КАК ВзаиморасчетыССотрудниками
			|{ГДЕ
			|	ВзаиморасчетыССотрудниками.Организация.*,
			|	ВзаиморасчетыССотрудниками.Сотрудник.*,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования.*,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов.*,
			|	ВзаиморасчетыССотрудниками.Подразделение.*}
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
			|ИЗ
			|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияИУдержания
			|ГДЕ
			|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	НачисленияИУдержания.Организация.*,
			|	НачисленияИУдержания.Сотрудник.*,
			|	НачисленияИУдержания.ФизическоеЛицо.*,
			|	НачисленияИУдержания.СтатьяФинансирования.*,
			|	НачисленияИУдержания.СтатьяРасходов.*,
			|	НачисленияИУдержания.Подразделение.*,
			|	НачисленияИУдержания.НачислениеУдержание.* КАК ВидРасчета}
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	НачисленияИУдержания.ПериодДействия
			|ИЗ
			|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияИУдержания
			|ГДЕ
			|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|	И НачисленияИУдержания.ПериодДействия <> ДАТАВРЕМЯ(1, 1, 1)
			|{ГДЕ
			|	НачисленияИУдержания.Организация.*,
			|	НачисленияИУдержания.Сотрудник.*,
			|	НачисленияИУдержания.ФизическоеЛицо.*,
			|	НачисленияИУдержания.СтатьяФинансирования.*,
			|	НачисленияИУдержания.СтатьяРасходов.*,
			|	НачисленияИУдержания.Подразделение.*,
			|	НачисленияИУдержания.НачислениеУдержание.* КАК ВидРасчета}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация КАК Организация,
			|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение КАК Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	ОстаткиИОбороты.Период КАК Период
			|ПОМЕСТИТЬ ВТВсеПериодомКадровыхДанных
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация,
			|	ОстаткиИОбороты.Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	Месяцы.Период
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация,
			|	ОстаткиИОбороты.Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	КОНЕЦПЕРИОДА(Месяцы.Период, МЕСЯЦ)
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация КАК Организация,
			|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение КАК Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	Месяцы.Период КАК Месяц
			|ПОМЕСТИТЬ ВТСотрудникиМесяцы
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
			|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
			|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости,
			|	"""" КАК Фамилия,
			|	"""" КАК Имя,
			|	"""" КАК Отчество,
			|	0 КАК ТарифнаяСтавка,
			|	0 КАК ТекущаяТарифнаяСтавка,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения
			|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
			|ИЗ
			|	ВТВсеПериодомКадровыхДанных КАК Сотрудники
			|ГДЕ
			|	""ТолькоРазрешенные"" = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовНачальныйОстаток КАК НачальныйОстаток,
			|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовКонечныйОстаток КАК КонечныйОстаток,
			|	ВзаиморасчетыССотрудниками.Период
			|ПОМЕСТИТЬ ВТОстаткиИОбороты
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Месяц, , {(Сотрудник), (ФизическоеЛицо), (Организация)}) КАК ВзаиморасчетыССотрудниками
			|{ГДЕ
			|	ВзаиморасчетыССотрудниками.Организация.*,
			|	ВзаиморасчетыССотрудниками.Сотрудник.*,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования.*,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов.*,
			|	ВзаиморасчетыССотрудниками.Подразделение.*}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиМесяцы.Организация КАК Организация,
			|	СотрудникиМесяцы.Сотрудник КАК Сотрудник,
			|	СотрудникиМесяцы.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиМесяцы.СтатьяФинансирования,
			|	СотрудникиМесяцы.СтатьяРасходов,
			|	СотрудникиМесяцы.Подразделение КАК Подразделение,
			|	СотрудникиМесяцы.Месяц,
			|	МАКСИМУМ(ОстаткиИОбороты.Период) КАК ПоследнийМесяцОстатков
			|ПОМЕСТИТЬ ВТСотрудникиМесяцыОстатков
			|ИЗ
			|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОбороты КАК ОстаткиИОбороты
			|		ПО СотрудникиМесяцы.Организация = ОстаткиИОбороты.Организация
			|			И СотрудникиМесяцы.Сотрудник = ОстаткиИОбороты.Сотрудник
			|			И СотрудникиМесяцы.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
			|			И СотрудникиМесяцы.Подразделение = ОстаткиИОбороты.Подразделение
			|			И СотрудникиМесяцы.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
			|			И СотрудникиМесяцы.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
			|			И СотрудникиМесяцы.Месяц >= ОстаткиИОбороты.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	СотрудникиМесяцы.Организация,
			|	СотрудникиМесяцы.Сотрудник,
			|	СотрудникиМесяцы.ФизическоеЛицо,
			|	СотрудникиМесяцы.СтатьяФинансирования,
			|	СотрудникиМесяцы.СтатьяРасходов,
			|	СотрудникиМесяцы.Подразделение,
			|	СотрудникиМесяцы.Месяц
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СотрудникиМесяцыОстатков.Организация КАК Организация,
			|	СотрудникиМесяцыОстатков.Сотрудник КАК Сотрудник,
			|	СотрудникиМесяцыОстатков.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиМесяцыОстатков.СтатьяФинансирования КАК СтатьяФинансирования,
			|	СотрудникиМесяцыОстатков.СтатьяРасходов КАК СтатьяРасходов,
			|	СотрудникиМесяцыОстатков.Подразделение КАК Подразделение,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА СотрудникиМесяцыОстатков.Месяц = ОстаткиИОбороты.Период
			|				ТОГДА ОстаткиИОбороты.НачальныйОстаток
			|			ИНАЧЕ ОстаткиИОбороты.КонечныйОстаток
			|		КОНЕЦ, 0) КАК НачальныйОстаток,
			|	КОНЕЦПЕРИОДА(СотрудникиМесяцыОстатков.Месяц, МЕСЯЦ) КАК Период
			|ПОМЕСТИТЬ ВТСальдоВсеСотрудникиПериоды
			|ИЗ
			|	ВТСотрудникиМесяцыОстатков КАК СотрудникиМесяцыОстатков
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОбороты КАК ОстаткиИОбороты
			|		ПО СотрудникиМесяцыОстатков.Организация = ОстаткиИОбороты.Организация
			|			И СотрудникиМесяцыОстатков.Сотрудник = ОстаткиИОбороты.Сотрудник
			|			И СотрудникиМесяцыОстатков.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
			|			И СотрудникиМесяцыОстатков.Подразделение = ОстаткиИОбороты.Подразделение
			|			И СотрудникиМесяцыОстатков.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
			|			И СотрудникиМесяцыОстатков.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
			|			И СотрудникиМесяцыОстатков.ПоследнийМесяцОстатков = ОстаткиИОбороты.Период
			|ГДЕ
			|	НЕ ОстаткиИОбороты.НачальныйОстаток ЕСТЬ NULL 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.НачальныйОстаток КАК НачальныйОстаток,
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудников.Фамилия,
			|	КадровыеДанныеСотрудников.Имя,
			|	КадровыеДанныеСотрудников.Отчество,
			|	КадровыеДанныеСотрудников.Должность,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <= КадровыеДанныеСотрудниковНаКонецПериода.Период
			|			ТОГДА КадровыеДанныеСотрудниковНаКонецПериода.ТекущаяТарифнаяСтавка
			|		ИНАЧЕ КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка
			|	КОНЕЦ КАК ТарифнаяСтавка,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	КадровыеДанныеСотрудников.ДатаУвольнения
			|ПОМЕСТИТЬ ВТСальдоПоРасчетамССотрудниками
			|ИЗ
			|	ВТСальдоВсеСотрудникиПериоды КАК ВзаиморасчетыССотрудниками
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудниковНаКонецПериода
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериода.Сотрудник
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериода.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И ВзаиморасчетыССотрудниками.Подразделение = КадровыеДанныеСотрудников.Подразделение
			|			И (КадровыеДанныеСотрудников.Период В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ПредставленияКадровыеДанныеСотрудниковОтбор.Период
			|				ИЗ
			|					ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудниковОтбор
			|				ГДЕ
			|					ВзаиморасчетыССотрудниками.Сотрудник = ПредставленияКадровыеДанныеСотрудниковОтбор.Сотрудник
			|					И ВзаиморасчетыССотрудниками.Подразделение = ПредставленияКадровыеДанныеСотрудниковОтбор.Подразделение
			|				УПОРЯДОЧИТЬ ПО
			|					ПредставленияКадровыеДанныеСотрудниковОтбор.Период УБЫВ))}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение КАК Подразделение,
			|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
			|	НачисленияИУдержания.НачислениеУдержание КАК ВидРасчета,
			|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
			|	НачисленияИУдержания.Организация КАК Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ДатаНачала,
			|	НачисленияИУдержания.ДатаОкончания,
			|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеГоловныхСотрудников.Фамилия,
			|	КадровыеДанныеГоловныхСотрудников.Имя,
			|	КадровыеДанныеГоловныхСотрудников.Отчество,
			|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	НачисленияИУдержания.ПериодДействия,
			|	НачисленияИУдержания.Регистратор,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
			|	КадровыеДанныеСотрудников.Должность,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <= КадровыеДанныеСотрудниковНаКонецПериода.Период
			|			ТОГДА КадровыеДанныеСотрудниковНаКонецПериода.ТекущаяТарифнаяСтавка
			|		ИНАЧЕ КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка
			|	КОНЕЦ КАК ТарифнаяСтавкаНаКонецПериода,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	NULL КАК Показатель,
			|	NULL КАК Значение,
			|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения,
			|	НачисленияИУдержания.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными
			|ИЗ
			|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияИУдержания
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудниковНаКонецПериода
			|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериода.Сотрудник
			|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериода.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
			|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И НачисленияИУдержания.Подразделение = КадровыеДанныеСотрудников.Подразделение
			|			И (КадровыеДанныеСотрудников.Период В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ПредставленияКадровыеДанныеСотрудниковОтбор.Период
			|				ИЗ
			|					ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудниковОтбор
			|				ГДЕ
			|					НачисленияИУдержания.Сотрудник = ПредставленияКадровыеДанныеСотрудниковОтбор.Сотрудник
			|					И НачисленияИУдержания.Подразделение = ПредставленияКадровыеДанныеСотрудниковОтбор.Подразделение
			|				УПОРЯДОЧИТЬ ПО
			|					ПредставленияКадровыеДанныеСотрудниковОтбор.Период УБЫВ))}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеГоловныхСотрудников
			|		ПО (ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
			|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
			|ГДЕ
			|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	НачисленияИУдержания.Сотрудник.*,
			|	НачисленияИУдержания.ФизическоеЛицо.*,
			|	НачисленияИУдержания.Организация.*,
			|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
			|	НачисленияИУдержания.НачислениеУдержание,
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ДатаНачала,
			|	НачисленияИУдержания.ДатаОкончания,
			|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник,
			|	КадровыеДанныеГоловныхСотрудников.Фамилия,
			|	КадровыеДанныеГоловныхСотрудников.Имя,
			|	КадровыеДанныеГоловныхСотрудников.Отчество,
			|	КадровыеДанныеГоловныхСотрудников.Должность,
			|	КадровыеДанныеГоловныхСотрудников.Подразделение,
			|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости,
			|	НачисленияИУдержания.Регистратор,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность,
			|	КадровыеДанныеСотрудников.Должность,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка,
			|	КадровыеДанныеСотрудников.ВидЗанятости,
			|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
			|	ВЫБОР
			|		КОГДА КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И КадровыеДанныеСотрудниковНаКонецПериода.ДатаУвольнения <= КадровыеДанныеСотрудниковНаКонецПериода.Период
			|			ТОГДА КадровыеДанныеСотрудниковНаКонецПериода.ТекущаяТарифнаяСтавка
			|		ИНАЧЕ КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка
			|	КОНЕЦ,
			|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения,
			|	НачисленияИУдержания.ПериодДействия,
			|	НачисленияИУдержания.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.Начисление КАК ВидРасчета,
			|	ЛОЖЬ КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДатаНачала,
			|	СУММА(ОтработанноеВремя.ОтработаноДней) КАК ОтработаноДней,
			|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	СУММА(ОтработанноеВремя.ОплаченоДней) КАК ОплаченоДней,
			|	СУММА(ОтработанноеВремя.ОплаченоЧасов) КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяВПериодах
			|ИЗ
			|	РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом КАК ОтработанноеВремя
			|ГДЕ
			|	ОтработанноеВремя.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	ОтработанноеВремя.Сотрудник.*,
			|	ОтработанноеВремя.ФизическоеЛицо.*,
			|	ОтработанноеВремя.Организация.*,
			|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.Начисление,
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДатаНачала,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяСНачислениями
			|ИЗ
			|	ВТОтработанноеВремяВПериодах КАК ОтработанноеВремя
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияИУдержания
			|		ПО (ОтработанноеВремя.МесяцНачисления = НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ))
			|			И ОтработанноеВремя.Регистратор = НачисленияИУдержания.Регистратор
			|			И ОтработанноеВремя.Сотрудник = НачисленияИУдержания.Сотрудник
			|			И ОтработанноеВремя.Подразделение = НачисленияИУдержания.Подразделение
			|			И ОтработанноеВремя.ВидРасчета = НачисленияИУдержания.НачислениеУдержание
			|			И ОтработанноеВремя.ИдентификаторСтроки = НачисленияИУдержания.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	МИНИМУМ(ОтработанноеВремя.СтатьяФинансирования) КАК СтатьяФинансирования,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяСоСтатьейФинансирования
			|ИЗ
			|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	МИНИМУМ(ОтработанноеВремя.СтатьяРасходов) КАК СтатьяРасходов,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремя
			|ИЗ
			|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяСоСтатьейФинансирования КАК ОтработанноеВремяСоСтатьейФинансирования
			|		ПО ОтработанноеВремя.МесяцНачисления = ОтработанноеВремяСоСтатьейФинансирования.МесяцНачисления
			|			И ОтработанноеВремя.ПериодДействия = ОтработанноеВремяСоСтатьейФинансирования.ПериодДействия
			|			И ОтработанноеВремя.Регистратор = ОтработанноеВремяСоСтатьейФинансирования.Регистратор
			|			И ОтработанноеВремя.Сотрудник = ОтработанноеВремяСоСтатьейФинансирования.Сотрудник
			|			И ОтработанноеВремя.Подразделение = ОтработанноеВремяСоСтатьейФинансирования.Подразделение
			|			И ОтработанноеВремя.ВидРасчета = ОтработанноеВремяСоСтатьейФинансирования.ВидРасчета
			|			И ОтработанноеВремя.ДатаНачала = ОтработанноеВремяСоСтатьейФинансирования.ДатаНачала
			|			И ОтработанноеВремя.СтатьяФинансирования = ОтработанноеВремяСоСтатьейФинансирования.СтатьяФинансирования
			|			И ОтработанноеВремя.ВремяВЧасах = ОтработанноеВремяСоСтатьейФинансирования.ВремяВЧасах
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПервыйМесяц,
			|	МАКСИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПоследнийМесяц,
			|	СальдоПоРасчетамССотрудниками.Организация,
			|	СальдоПоРасчетамССотрудниками.Сотрудник,
			|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо,
			|	СальдоПоРасчетамССотрудниками.Подразделение,
			|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования,
			|	СальдоПоРасчетамССотрудниками.СтатьяРасходов
			|ПОМЕСТИТЬ ВТПоследниеПервыеМесяцы
			|ИЗ
			|	ВТСальдоПоРасчетамССотрудниками КАК СальдоПоРасчетамССотрудниками
			|
			|СГРУППИРОВАТЬ ПО
			|	СальдоПоРасчетамССотрудниками.Организация,
			|	СальдоПоРасчетамССотрудниками.Сотрудник,
			|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо,
			|	СальдоПоРасчетамССотрудниками.Подразделение,
			|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования,
			|	СальдоПоРасчетамССотрудниками.СтатьяРасходов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.ГруппаНачисленияУдержанияВыплаты КАК Группа,
			|	ВзаиморасчетыССотрудниками.ВидВзаиморасчетов КАК ВидРасчета,
			|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов КАК Сумма,
			|	ВЫБОР
			|		КОГДА НЕ ВзаиморасчетыССотрудниками.Подразделение.Владелец ЕСТЬ NULL 
			|			ТОГДА ВзаиморасчетыССотрудниками.Подразделение.Владелец
			|		КОГДА КадровыеДанныеСотрудников.Организация <> ЗНАЧЕНИЕ(СПРАВОЧНИК.Организации.ПустаяСсылка)
			|			ТОГДА КадровыеДанныеСотрудников.Организация
			|		ИНАЧЕ ВзаиморасчетыССотрудниками.Организация
			|	КОНЕЦ КАК Организация,
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеГоловныхСотрудников.Фамилия,
			|	КадровыеДанныеГоловныхСотрудников.Имя,
			|	КадровыеДанныеГоловныхСотрудников.Отчество,
			|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК ПериодДействия,
			|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор,
			|	КадровыеДанныеСотрудников.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,
			|	ВЫБОР
			|		КОГДА КадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И КадровыеДанныеСотрудников.ДатаУвольнения <= КадровыеДанныеСотрудников.Период
			|			ТОГДА КадровыеДанныеСотрудников.ТекущаяТарифнаяСтавка
			|		ИНАЧЕ КадровыеДанныеСотрудников.ТарифнаяСтавка
			|	КОНЕЦ КАК ТарифнаяСтавкаНаКонецПериода,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	КадровыеДанныеСотрудников.Должность,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения
			|ПОМЕСТИТЬ ВТДвиженияВзаиморасчетов
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудников.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеГоловныхСотрудников
			|		ПО (ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
			|ГДЕ
			|	ВзаиморасчетыССотрудниками.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И ВзаиморасчетыССотрудниками.ВидВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ПустаяСсылка)
			|{ГДЕ
			|	ВзаиморасчетыССотрудниками.Сотрудник.*,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
			|	ВзаиморасчетыССотрудниками.Организация.*,
			|	ВзаиморасчетыССотрудниками.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеСотрудников.МесяцНачисления КАК МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов КАК СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение КАК Подразделение,
			|	ДанныеСотрудников.Группа КАК Группа,
			|	ДанныеСотрудников.ВидРасчета КАК ВидРасчета,
			|	ДанныеСотрудников.Сумма КАК Сумма,
			|	ДанныеСотрудников.ДатаНачала,
			|	ДанныеСотрудников.ДатаОкончания,
			|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДней, 0) КАК ОтработаноДней,
			|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасов, 0) КАК ОтработаноЧасов,
			|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоДней, 0) КАК ОплаченоДней,
			|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоЧасов, 0) КАК ОплаченоЧасов,
			|	ДанныеСотрудников.Организация КАК Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПериодДействия,
			|	ДанныеСотрудников.Регистратор,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода КАК ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода КАК ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ДанныеСотрудников.Показатель,
			|	ДанныеСотрудников.Значение,
			|	ДанныеСотрудников.ДатаУвольнения
			|ПОМЕСТИТЬ ОбщиеЗапросы_НачисленияУдержанияАвансом
			|ИЗ
			|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
			|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанноеВремя КАК ОтработанноеВремя
			|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
			|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
			|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
			|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
			|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
			|			И ДанныеСотрудников.ДатаНачала = ОтработанноеВремя.ДатаНачала
			|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
			|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов
			|			И ДанныеСотрудников.ИдентификаторСтроки = ОтработанноеВремя.ИдентификаторСтроки}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ДанныеСотрудников.Группа,
			|	ДанныеСотрудников.ВидРасчета,
			|	ДанныеСотрудников.Сумма,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПериодДействия,
			|	ДанныеСотрудников.Регистратор,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения
			|ИЗ
			|	ВТДвиженияВзаиморасчетов КАК ДанныеСотрудников
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.Период,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.НачальноеСальдо),
			|	NULL,
			|	ДанныеСотрудников.НачальныйОстаток,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения
			|ИЗ
			|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
			|ГДЕ
			|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL ";
		
		ДополнитьТекстЗапросаНачисленияУдержанияКадровымиДанными(ТекстЗапроса);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Запрос = Неопределено;
	
	ПозицияСловаПоместить = СтрНайти(ВРег(ТекстЗапроса), "ПОМЕСТИТЬ ");
	
	ИмяИсточникаДанных = ЗарплатаКадрыОбщиеНаборыДанных.ПервоеСловоНачинаяСПозицииВТексте(ТекстЗапроса, ПозицияСловаПоместить + СтрДлина("ПОМЕСТИТЬ "));
	МассивПодстрокИмениИсточникаДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяИсточникаДанных, "_");
	ИмяВременнойТаблицы = МассивПодстрокИмениИсточникаДанных[0];
	ИмяПредставления = МассивПодстрокИмениИсточникаДанных[1];
	Если МассивПодстрокИмениИсточникаДанных.Количество() > 2 Тогда
		ИмяПараметра = МассивПодстрокИмениИсточникаДанных[2];
	Иначе
		ИмяПараметра = Неопределено;
	КонецЕсли;
				
	МассивИменВТИсточниковПараметров = ЗарплатаКадрыОбщиеНаборыДанных.МассивИменВТИсточниковПараметров(ТекстЗапроса, ИмяИсточникаДанных);
	ПараметрыЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыЗапроса(ТекстЗапроса, ИмяИсточникаДанных);
				
	ПредставлениеТолькоРазрешенные = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ТолькоРазрешенные", ПараметрыЗапроса);
	ТолькоРазрешенные = ВРег(ПредставлениеТолькоРазрешенные) = "ИСТИНА";
	
	Если ВРег(ИмяПредставления) = ВРег("ШтатноеРасписание") Тогда
		
		ПредставлениеВключатьНачисления = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ВключатьНачисления", ПараметрыЗапроса);
		НеВключатьНачисления = ВРег(ПредставлениеВключатьНачисления) = "ЛОЖЬ";
	
		ДатаАктуальности = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ДатаАктуальности", ПараметрыЗапроса);
		Если МассивИменВТИсточниковПараметров.Количество() > 0  Тогда
			ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Иначе
			ИмяВТИсточникДанных = "";
		КонецЕсли;
		
		Запрос = УправлениеШтатнымРасписанием.ЗапросПредставленияШтатноеРасписание(ТолькоРазрешенные, ДатаАктуальности, ИмяИсточникаДанных, НЕ НеВключатьНачисления, ИмяВТИсточникДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ТекущаяКадроваяРасстановка") Тогда
		
		Организация = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Организация", ПараметрыЗапроса);
		Дата = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Дата", ПараметрыЗапроса);
		
		Запрос = КадровыйУчетРасширенный.ЗапросВТТекущаяКадроваяРасстановка(
			ТолькоРазрешенные,
			Организация,
			Дата,
			ИмяИсточникаДанных);
			
	ИначеЕсли ВРег(ИмяПредставления) = ВРЕг("ФункциональныеОпцииОрганизаций") Тогда
			
		МассивИменФункциональныхОпций =  ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		
		Запрос = КадровыйУчетБазовый.ЗапросВТФункциональныеОпцииОрганизаций(
			ТолькоРазрешенные,
			ИмяИсточникаДанных,
			МассивИменФункциональныхОпций);
				
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ФактическиеОтпускаСотрудников") Тогда
			
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		
		ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТФактическиеОтпускаСотрудников(
			Неопределено,
			ИмяВТИсточникДанных,
			,
			ИмяИсточникаДанных);
		
		Запрос = ОстаткиОтпусков.ЗапросВТФактическиеОтпускаСотрудников(ОписательВременныхТаблиц, ТолькоРазрешенные);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ПлановыеНачисленияСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Запрос = КадровыйУчетРасширенный.ЗапросВТПлановыеНачисленияСотрудников(ТолькоРазрешенные, ИмяИсточникаДанных, ИмяВТИсточникДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ПлановыеУдержанияСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Запрос = КадровыйУчетРасширенный.ЗапросВТПлановыеУдержанияСотрудников(ТолькоРазрешенные, ИмяИсточникаДанных, ИмяВТИсточникДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СтажиСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		ОписаниеВременнойТаблицыОтборов = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц(ИмяВТИсточникДанных);
		Запрос = КадровыйУчетРасширенный.ЗапросВТСтажиФизическихЛиц(ТолькоРазрешенные, ОписаниеВременнойТаблицыОтборов, , ИмяИсточникаДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СвойстваСтатейФинансирования") Тогда
		
		Если ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СвойстваСтатейФинансированияУчетБюджетныхУчреждений.СтатьяФинансирования КАК СтатьяФинансирования,
				|	ВЫБОР
				|		КОГДА СвойстваСтатейФинансированияУчетБюджетныхУчреждений.КФО = ЗНАЧЕНИЕ(Перечисление.КФО.Внебюджет)
				|			ТОГДА 2
				|		КОГДА СвойстваСтатейФинансированияУчетБюджетныхУчреждений.КФО = ЗНАЧЕНИЕ(Перечисление.КФО.СредстваОМС)
				|			ТОГДА 3
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК НомерКолонки
				|ПОМЕСТИТЬ Представления_СвойстваСтатейФинансирования
				|ИЗ
				|	РегистрСведений.СвойстваСтатейФинансированияУчетБюджетныхУчреждений КАК СвойстваСтатейФинансированияУчетБюджетныхУчреждений";
			
		ИначеЕсли  ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СтатьиФинансированияЗарплата.Ссылка КАК СтатьяФинансирования,
				|	2 КАК НомерКолонки
				|ПОМЕСТИТЬ Представления_СвойстваСтатейФинансирования
				|ИЗ
				|	Справочник.СтатьиФинансированияЗарплата КАК СтатьиФинансированияЗарплата";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Запрос = УчетРабочегоВремениРасширенный.ЗапросПоПредставлению(ТолькоРазрешенные, ИмяПредставления, МассивИменВТИсточниковПараметров, ПараметрыЗапроса, ИмяИсточникаДанных);
	КонецЕсли;	
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
			Запрос = Модуль.ЗапросПоПредставлению(ИмяПредставления, МассивИменВТИсточниковПараметров, ТолькоРазрешенные);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АттестацииСотрудников") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("АттестацииСотрудников");
			Запрос = Модуль.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("Медицина");
			Запрос = Модуль.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров);
	КонецЕсли; 	
		
	Возврат Запрос;	
	
КонецФункции

Процедура ПриПолученииСвойствРегистра(ИмяРегистра, СтруктураОписанияРегистра) Экспорт
	ПлановыеНачисленияСотрудников.ПриПолученииСвойствРегистраВторичныхДанных(ИмяРегистра, СтруктураОписанияРегистра);	
КонецПроцедуры

#Область КонтекстноеДополнениеСхемКомпоновки

Процедура ДополнитьАнализЗадолженностиПоЗарплате(ЭтотОбъект) Экспорт 
		
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
			ОбщегоНазначения.ОбщийМодуль("УчетБюджетныхУчреждений").ДополнитьАнализЗадолженностиПоЗарплате(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьШтатноеРасписание(ЭтотОбъект) Экспорт 
		
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
			ОбщегоНазначения.ОбщийМодуль("УчетБюджетныхУчреждений").ДополнитьШтатноеРасписание(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьШтатноеРасписаниеНачисления(ЭтотОбъект) Экспорт 
	
	Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
			ОбщегоНазначения.ОбщийМодуль("УчетБюджетныхУчреждений").ДополнитьШтатноеРасписаниеНачисления(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ДополнитьТекстЗапросаНачисленияУдержанияКадровымиДанными(ТекстЗапроса)
	
	// Добавление полей разрядов, категорий должностей.
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,",
		"	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеСотрудников.Должность,",
		"	КадровыеДанныеСотрудников.Должность,
		|	КадровыеДанныеСотрудников.РазрядКатегория,");
	
	// Разряд, категория головного сотрудника
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,",
		"	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеГоловныхСотрудников.РазрядКатегория КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,",
		"	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеГоловныхСотрудников.Должность,",
		"	КадровыеДанныеГоловныхСотрудников.Должность,
		|	КадровыеДанныеГоловныхСотрудников.РазрядКатегория,");
	
	// Разряд, категория на конец месяца
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,",
		"	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,
		|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегорияНаКонецПериода,");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,",
		"	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
		|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория КАК РазрядКатегорияНаКонецПериода,");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	КадровыеДанныеСотрудниковНаКонецПериода.Должность,",
		"	КадровыеДанныеСотрудниковНаКонецПериода.Должность,
		|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория,");
	
	// Разряды, категории в результирующей таблице
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "	ДанныеСотрудников.Должность,",
		"	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.РазрядКатегория,
		|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
		|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,");
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаНачисленияУдержанияЗначениямиПоказателей(ТекстЗапроса)
	
	МассивПодзапросов = СтрРазделить(ТекстЗапроса, ";");
	Для каждого ТекстПодзапроса Из МассивПодзапросов Цикл
		
		Если СтрНайти(ВРег(ТекстПодзапроса), ВРег("ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными")) > 0 Тогда
			
			ИсходныйПодзапрос = ТекстПодзапроса;
			
			ПозицияГде = СтрНайти(ТекстПодзапроса, Символы.ПС + "ГДЕ" + Символы.ПС);
			Если ПозицияГде > 0 Тогда
				
				ТекстЗапросаПоказателейНачислений =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	СотрудникиМесяцы.Организация КАК Организация,
					|	СотрудникиМесяцы.Сотрудник КАК Сотрудник,
					|	СотрудникиМесяцы.Месяц КАК ПериодРегистрации,
					|	Начисления.Регистратор,
					|	Начисления.ПериодДействияНачало,
					|	МИНИМУМ(Начисления.ПериодДействияКонец) КАК ПериодДействияКонец,
					|	Начисления.ВидРасчета,
					|	НачисленияПоказатели.Показатель,
					|	Начисления.ИдентификаторСтроки
					|ПОМЕСТИТЬ ВТПоказателиНачисленийПредварительно
					|ИЗ
					|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Начисления КАК Начисления
					|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
					|			ПО Начисления.ВидРасчета = НачисленияПоказатели.Ссылка
					|				И (НачисленияПоказатели.ОсновнойПоказатель)
					|		ПО СотрудникиМесяцы.Сотрудник = Начисления.Сотрудник
					|			И СотрудникиМесяцы.Месяц = Начисления.ПериодРегистрации
					|ГДЕ
					|	НЕ НачисленияПоказатели.Показатель ЕСТЬ NULL 
					|
					|СГРУППИРОВАТЬ ПО
					|	СотрудникиМесяцы.Организация,
					|	СотрудникиМесяцы.Сотрудник,
					|	СотрудникиМесяцы.Месяц,
					|	Начисления.Регистратор,
					|	Начисления.ПериодДействияНачало,
					|	Начисления.ВидРасчета,
					|	Начисления.ИдентификаторСтроки,
					|	НачисленияПоказатели.Показатель
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	ПоказателиНачислений.Организация,
					|	ПоказателиНачислений.Сотрудник,
					|	ПоказателиНачислений.ПериодРегистрации,
					|	ПоказателиНачислений.Регистратор,
					|	ПоказателиНачислений.ПериодДействияНачало,
					|	ПоказателиНачислений.ПериодДействияКонец,
					|	ПоказателиНачислений.ВидРасчета,
					|	ПоказателиНачислений.ИдентификаторСтроки,
					|	ЗначенияПоказателейНачислений.Показатель КАК Показатель,
					|	МАКСИМУМ(ЗначенияПоказателейНачислений.Значение) КАК Значение
					|ПОМЕСТИТЬ ВТПоказателиНачислений
					|ИЗ
					|	ВТПоказателиНачисленийПредварительно КАК ПоказателиНачислений
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейНачислений КАК ЗначенияПоказателейНачислений
					|		ПО ПоказателиНачислений.Регистратор = ЗначенияПоказателейНачислений.Регистратор
					|			И ПоказателиНачислений.ИдентификаторСтроки = ЗначенияПоказателейНачислений.ИдентификаторСтроки
					|			И ПоказателиНачислений.Показатель = ЗначенияПоказателейНачислений.Показатель
					|
					|СГРУППИРОВАТЬ ПО
					|	ПоказателиНачислений.Организация,
					|	ПоказателиНачислений.Сотрудник,
					|	ПоказателиНачислений.ПериодРегистрации,
					|	ПоказателиНачислений.Регистратор,
					|	ПоказателиНачислений.ПериодДействияНачало,
					|	ПоказателиНачислений.ПериодДействияКонец,
					|	ПоказателиНачислений.ВидРасчета,
					|	ПоказателиНачислений.ИдентификаторСтроки,
					|	ЗначенияПоказателейНачислений.Показатель";
				
				СоединениеСТаблицамиПоказателей = "
					|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиНачислений КАК ПоказателиНачислений
					|		ПО НачисленияИУдержания.Регистратор = ПоказателиНачислений.Регистратор
					|			И НачисленияИУдержания.НачислениеУдержание = ПоказателиНачислений.ВидРасчета
					|			И НачисленияИУдержания.Сотрудник = ПоказателиНачислений.Сотрудник
					|			И НачисленияИУдержания.ИдентификаторСтроки = ПоказателиНачислений.ИдентификаторСтроки}
					|";
				
				ТекстПодзапроса = Лев(ТекстПодзапроса, ПозицияГде - 1) + СоединениеСТаблицамиПоказателей + Сред(ТекстПодзапроса, ПозицияГде);
				
				ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "NULL КАК Показатель", "МАКСИМУМ(ПоказателиНачислений.Показатель) КАК Показатель");
				ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "NULL КАК Значение", "МАКСИМУМ(ПоказателиНачислений.Значение) КАК Значение");
				
				ТекстПодзапроса = ТекстЗапросаПоказателейНачислений
					+ ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов()
					+ ТекстПодзапроса;
				
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИсходныйПодзапрос, ТекстПодзапроса);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
